Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/office_of_the_supreme_court.html.txt.tmx
Source language: en
Languages: ga

source: Office of the Supreme Court
ga: Oifig an Chúirt Uachtarach

source: The Supreme Court Registrar is the head of the office and he/she sits in court when the Supreme Court is sitting
ga: Sé Cláraitheoir na Cúirte Uachtaraigh ceann na hoifige agus suíonn sé/sí sa chúirt nuair atá an Chúirt Uachtarach ag suí

source: The Supreme Court office:
ga: Bíonn oifig na Cúirte Uachtaraigh

source: • Provides administrative support to the Supreme Courtl,
ga: • Ag cur tacaíocht riarthach ar fáil don Chúirt Uachtarach

source: • Processes appeals from decisions of the High Court,
ga: • Ag próiseáil acomhairc ó chinnte de chuid na hArd Chúirte

source: • Authenticates signatures of Notaries Public and Commissioners for Oaths on official documents where required,
ga: • Ag dearbhú údaracht síníucháin Nótairí Poiblí agus Coimisinéirí Mionnaí ar cháipéisí oifigiúla nuair is gá

source: • Deals with applications for appointment as a Notary Public
ga: • Ag láimhseáil iarratais ar cheapachán mar Nótaire Poiblí

source: • Deals with applications for appointment as a Commissioner for Oaths
ga: • Ag láimhseáil iarratais ar cheapachán mar Choimisinéir Mionnaí

source: The Legal Diary, which is published daily, is kept up to date with a listing of cases in the Supreme Court
ga: Coimeádtar an Dialann Dhlíthiúil, a fhoilsítear go laethúil, suas chun dáta le liostú de chásanna sa Chúirt Uachtarach
